<template>
    <div class="terms ">
         <div class="title">用户服务协议</div>
         <div class="tip">
             <h3>重要提示：</h3>
             <div>
深圳碳链技术股份有限公司作为车碳宝的提供商、运营商（以下简称“碳链”），依据《用户服务协议》（以下简称《协议》）的规定为用户提供服务，本协议在碳链与用户之间具有合同上的法律效力。请务必认真阅读、充分理解本《协议》中规定的所有权利和限制，并选择接受或者不接受本协议。除非用户接受本《协议》条款，否则用户无权下载、安装或使用本"软件"及其相关服务。用户一旦安装、复制、下载、访问或以其它方式使用本软件产品或成功注册成为用户，将视为对本《协议》的全部条款已充分理解并完全接受，即表示用户同意接受本《协议》各项条款的约束。如果用户不同意本《协议》中的条款，请不要安装、复制或使用本软件。
             </div>
         </div>
         <div class="content">
             <h3>一、协议内容及签署</h3>
             <div>
                 1.1 本协议内容包括协议正文及所有碳链已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何碳链及其关联实体提供的服务（以下称为碳链平台服务）均受本协议约束。
             </div>
             <div>
                1.2 用户应当在使用碳链平台服务之前认真阅读全部协议内容。如用户对协议有任何疑问的，应向碳链咨询。但无论用户事实上是否在使用碳链平台服务之前认真阅读了本协议内容，只要用户使用碳链平台服务，则本协议即对用户产生约束，届时用户不应以未阅读本协议的内容或者未获得碳链对用户问询的解答等理由，主张本协议无效，或要求撤销本协议。 
             </div>
             <div>
                 1.3 用户承诺接受并遵守本协议的约定。如果用户不同意本协议的约定，用户有权停止注册/激活程序或停止使用碳链平台服务。经注册或使用车碳宝即视为对本服务协议的充分理解和接受，如有违反而导致任何法律后果的发生，用户将以自己的名义独立承担相应的法律责任。
             </div> 
             <div>
                 1.4 在本协议履行过程中，碳链有权根据情况对本服务协议及各类规则进行修改或制订。一旦本服务协议的内容发生变动，碳链将通过网站或APP等方式公布最新的服务协议，不再向用户作个别通知。变更后的协议和规则一经在网站公布后，立即自动生效。如用户不同意相关变更，有权停止使用碳链平台服务。用户继续使用碳链平台服务的，则视为用户已接受碳链对本服务协议所做的修改，并应遵照修改后的协议执行。
             </div>
             <div>
                 1.5 碳链可以依其自主判断暂时停止提供、限制或改变具体服务，只要用户仍然使用车碳宝，即表示用户仍然同意本服务协议。
             </div>
             <h3>二、用户</h3>
             <div>2.1 用户资格</div>
             <div>2.1.1 用户确认，在用户完成注册程序或以其他碳链允许的方式实际使用碳链平台服务时，用户应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若用户不具备前述主体资格，则用户及用户的监护人应承担因此而导致的一切后果，且碳链有权注销或永久冻结用户的账户，并向用户及用户的监护人索偿。</div>
             <div>2.2 用户账户</div>
             <div>2.2.1 在用户按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在用户按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或用户以其他碳链允许的方式实际使用车碳宝平台时，用户即受本协议约束。用户可以使用用户提供或确认的邮箱、手机号码或者碳链允许的其它方式作为登录手段进入碳链平台服务。</div>
             <div>2.2.2 除非有法律规定或司法裁定，或者符合碳链公布的条件，否则用户的登录名、车碳宝昵称和密码不得以任何方式转让、赠与或继承，并且转让、赠与或继承需提供碳链要求的合格的文件材料并根据碳链制定的操作流程办理。</div>
             <div>2.3 用户信息</div>
             <div>2.3.1用户必须依碳链要求提示提供个人真实、最新、有效及完整的资料。用户有义务维持并更新用户的资料，确保其为真实、最新、有效及完整。若用户提供任何错误、虚假、过时或不完整的资料，或者碳链依其独立判断怀疑资料为错误、虚假、过时或不完整，碳链有权暂停或终止用户的用户资格，并拒绝用户使用车碳宝的部份或全部功能。在此情况下，碳链不承担任何责任，并且用户同意负担因此所产生的直接或间接的任何支出或损失。</div>
             <div>2.3.1用户必须依碳链要求提示提供个人真实、最新、有效及完整的资料。用户有义务维持并更新用户的资料，确保其为真实、最新、有效及完整。若用户提供任何错误、虚假、过时或不完整的资料，或者碳链依其独立判断怀疑资料为错误、虚假、过时或不完整，碳链有权暂停或终止用户的用户资格，并拒绝用户使用车碳宝的部份或全部功能。在此情况下，碳链不承担任何责任，并且用户同意负担因此所产生的直接或间接的任何支出或损失。</div>
             <h3>三、车碳宝平台服务</h3>
             <div>3.1 碳链通过车碳宝平台向用户提供服务，因未能完成认证而无法享受车碳宝服务造成的损失，碳链不承担任何责任。</div>
             <div>3.2 若用户在车碳宝平台交易途中发生纠纷时，任意一方或双方共同提交碳链要求调处，则碳链有权根据单方判断做出调处决定，用户了解并同意接受碳链的判断和调处决定。</div>
             <div>3.3 用户了解并同意碳链有权应政府部门（包括司法及行政部门）的要求，向其提供用户向碳链提供的用户信息和交易记录等必要信息。如用户涉嫌侵犯他人知识产权等合法权益，则碳链亦有权在初步判断涉嫌侵权行为存在的情况下，保证权利人对该情况知悉的权利。</div>
             <div>3.4 用户在使用车碳宝平台服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面可能产生的费用，均由用户独自承担。</div>
             <div>3.5 服务可包含对其他网站或内容或资源的超级链接。碳链可能并不控制由碳链以外的公司或个人提供的任何网站或资源。</div>
             <div>3.6 用户认知并同意，碳链不对该等外部网站或资源的可用性负责，亦不对该等网络或资源上的或从该等网站或资源获得的任何广告、产品或其他材料加以认可。</div>
             <div>3.7 用户认知并同意，碳链不对由于用户由于那些外部的网站或资源的可用性或用户对该等网站或资源上的或从该等网站或资源获得的任何广告、产品或其他材料的完整性、准确性或存在的信赖而发生的任何损失或损害承担责任。用户在使用过程中应注意仔细辨别，保护自我权益，由此导致的用户方的所有损失，碳链亦不承担任何责任。同时，经由车碳宝的使用下载或取得任何资料，应由用户自行考量且自负风险，因资料的下载而导致的任何损坏由用户自行承担。</div>
             <h3>四、隐私条款及授权条款</h3>
             <div>4.1 碳链对于用户提供的、碳链自行收集的、经认证的个人信息将按照本协议予以保护、使用或者披露。未经碳链事先书面同意，用户不得转让其在本协议项下的任何权利和义务。</div>
             <div>4.2 碳链可能自公开及私人资料来源收集用户的额外资料，以更好地掌握用户的情况，并为用户度身订造车碳宝的各项服务。</div>
             <div>4.3 用户同意，对于用户所提供的全部信息与资料以及用户在使用碳链提供的车联网服务的过程中碳链搜集整理后形成的有关数据，用户授予碳链及碳链关联实体独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)。</div>
             <div>4.4 为方便用户使用车碳宝及碳链相关服务或其他组织的服务（以下称其他服务），用户同意并授权碳链将用户在账户注册/激活、使用车碳宝过程中提供、形成的信息传递给向用户提供其他服务的组织，或从提供其他服务的组织获取用户在注册/激活、使用其他服务期间提供、形成的信息。用户同意不会因此追究碳链或其关联实体的责任。</div>
             <div>4.5 碳链采用行业标准惯例以保护用户的资料。用户因履行本协议提供给碳链的信息，碳链不会恶意出售或免费共享给任何第三方，以下情况除外：</div>
             <div>4.5.1 提供独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等；</div>
             <div>4.5.2 具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构，如公安机关、法院；</div>
             <div>4.5.3 碳链的关联实体；</div>
             <div>4.5.4 经用户或用户授权代表同意的第三方。</div>
             <h3>五、许可范围</h3>
             <div>5.1 下载、安装和使用：本软件为免费软件，用户可以非商业性、无限制数量地下载、安装及使用本软件。</div>
             <div>5.2 复制、分发和传播：用户可以非商业性、无限制数量地复制、分发和传播本软件产品。但必须保证每一份复制、分发和传播都是完整和真实的,包括所有有关本软件产品的软件、电子文档,版权和商标，亦包括本协议。</div>         
            <h3>六、知识产权的保护</h3>
            <div>6.1 车碳宝平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计，均由碳链或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</div>
            <div>6.2 非经碳链或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表车碳宝平台程序或内容。</div>
            <div>6.3 用户未经碳链的明确书面同意不许下载（除了页面缓存）或修改平台或其任何部分。用户不得对碳链平台或其内容进行转售或商业利用；不得收集和利用产品目录、说明和价格；不得对车碳宝平台或其内容进行任何衍生利用；不得为其他商业利益而下载或拷贝账户信息或使用任何数据采集、Robots或类似的数据收集和摘录工具。未经碳链的书面许可，严禁对车碳宝的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录（无论是否通过Robots、Spiders、自动仪器或手工操作）。另外，严禁为任何未经本使用条件明确允许的目的而使用碳链平台上的内容和材料。</div> 
            <div>6.4 禁止反向工程、反向编译和反向汇编：用户不得对本软件产品进行反向工程（ReverseEngineer）、反向编译（Decompile）或反向汇编（Disassemble），同时不得改动编译在程序文件内部的任何资源。除法律、法规明文规定允许上述活动外，用户必须遵守此协议限制。</div>
            <div>6.5 尊重知识产权是用户应尽的义务，如有违反，用户应对碳链承担损害赔偿等法律责任。本条款的有效期为法律规定的最高期限。</div>
            <h3>七、权利限制</h3>
            <div>7.1 在下列情况下用户不可使用服务且不能接受本条款：</div>
            <div>7.1.1 用户未达到与碳链订立有约束力的合同的法定年龄。</div>
            <div>7.1.2 根据中国或其他国家（包括用户居住的或用户从那里使用服务的国家）的法律，用户是被禁止接受服务的人。</div>
            <h3>八、用户的守法义务及承诺</h3>
            <div>8.1 用户承诺绝不为任何非法目的或以任何非法方式使用车碳宝，并承诺遵守中国相关法律、法规及一切使用互联网之国际惯例，遵守所有与车碳宝有关的网络协议、规则和程序。</div>
            <div>8.2 用户同意并保证不得利用车碳宝从事侵害他人权益或违法之行为，若有违反者应负所有法律责任。上述行为包括但不限于：</div>
            <div>8.2.1反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的。</div>
            <div>8.2.2 侵害他人名誉、隐私权、商业秘密、商标权、著作权、专利权、其他知识产权及其他权益。</div>
            <div>8.2.3 违反依法律或合约所应负之保密义务。</div>
            <div>8.2.4 冒用他人名义使用车碳宝。</div>
            <div>8.2.5 从事任何可能含有电脑病毒或是可能侵害车碳宝系統、资料等行为。</div>
            <div>8.2.6 利用车碳宝系统进行可能对互联网或移动网正常运转造成不利影响之行为。</div>
            <div>8.2.7 侵犯碳链的商业利益，包括但不限于发布非经碳链许可的商业广告。</div>
            <div>8.2.8 其他碳链有正当理由认为不适当之行为。</div>
            <h3>九、服务中断或故障</h3>
            <div>9.1 用户同意，基于互联网的特殊性，碳链不担保服务不会中断，也不担保服务的及时性和安全性。系统因相关状况无法正常运作，使用户无法使用任何车碳宝或使用任何车碳宝服务时受到任何影响时，碳链对用户或第三方不负任何责任，前述状况包括但不限于：</div>
            <div>9.1.1车碳宝系统停机维护期间。</div>
            <div>9.1.2电信设备出现故障不能进行数据传输的。</div>
            <div>9.1.3 由于黑客攻击、网络供应商技术调整或故障、网站升级等原因而造成的车碳宝中断或延迟。</div>
            <div>9.1.4 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成车碳宝障碍不能执行业务的。</div>
            <h3>十、 条款的法律适用及争端解决</h3>
            <div>10.1 本协议是由用户与碳链共同签订的，适用于用户在碳链的全部活动。本协议内容包括但不限于协议正文条款及已经发布的或将来可能发布的各类规则，所有条款和规则为协议不可分割的一部分，与协议正文具有同等法律效力。</div>
            <div>10.2 本协议不涉及用户与车碳宝的其他会员之间，因网上交易而产生的法律关系及法律纠纷。但用户在此同意将全面接受并履行与碳链其他会员在碳链签订的任何电子法律文本，并承诺按照该法律文本享有和/或放弃相应的权利、承担和/或豁免相应的义务。</div>
           <div>10.3 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，并可被尽可能接近各方意图的、能够保留本协议要求的经济目的的、有效的新条款所取代，而且，在此情况下，本协议的其他条款仍然完全有效并具有约束力。</div>
           <div>10.4 本协议及其修订的有效性、履行与本协议及其修订效力有关的所有事宜，将受中国法律管辖，任何争议仅适用中国法律。</div>
           <div>10.5 因本协议所引起的会员与碳链的任何纠纷或争议，首先应友好协商解决。协商不成的，用户在此完全同意将纠纷或争议提交深圳碳链技术股份有限公司所在地有管辖权的人民法院诉讼解决。</div>
           <h3>十一、其他说明</h3>
           <div>11.1用户自碳链及碳链工作人员或经由车碳宝取得的建议或资讯，无论其为书面或口头，均不构成碳链对车碳宝的任何保证。</div>
           <div>11.2 用户同意，用户服务的暂停、中断或终止不代表用户责任的终止，用户仍应对使用车碳宝期间的行为承担可能的违约或损害赔偿责任，同时碳链仍可保有用户的相关信息。</div>
           <div>11.3碳链对于用户的通知及任何其他的协议、告示或其他关于用户使用个人账号及服务的通知，用户同意碳链可通过车碳宝平台公告、电子邮件、手机短信、无线通讯装置等电子方式或常规的信件传递等方式进行，该等通知于发送之日视为已送达收件人。因信息传输等原因导致用户未在前述通知发出当日收到该等通知的，碳链不承担任何责任。
                    可根据实际情况添加车碳宝的主要服务。</div>


         </div> 
    </div>       
</template>
<script>
export default {
    
}
</script>
<style lang="less" scoped>
   .terms{
      position:absolute;
      top: 0;
      left: 0;
      width: 100%;
      height:100%;
      box-sizing: border-box;
      padding-left: 20px;
      padding-right:20px;
   
      .tip{
          h3{
              font-weight: bold;
              margin-bottom: 10px;
          }
      }
      .title{
          text-align: center;
          font-weight: bold;
          margin-top: 15px;
          margin-bottom: 15px;
      }
      .content{
          h3{
              margin-top: 13px;
              margin-bottom: 13px;
              font-weight: bold;
          }
          div{
              margin-bottom: 8px;
          }
      }
   }
</style>
